using Godot;
using System;

//----------------------------------------------------------------------------------------------------
// タイトル画面の管理  
//----------------------------------------------------------------------------------------------------
public partial class Title : Node2D
{
	[Export]Node2D   _logo;
	[Export]Sprite2D _fade;
	double timer = 2.0;
	
	//--------------------------------------------------------------------------------
	// 初期化処理  
	//--------------------------------------------------------------------------------
	public override void _Ready()
	{
		
	}

	//--------------------------------------------------------------------------------
	// 更新処理 
	//--------------------------------------------------------------------------------
	public override void _Process(double delta)
	{
		if(timer > 0)
		{
			timer -= delta;
			float alpha = timer > 1 ? 1 : (float)timer;
			Color color = new Color(0,0,0,alpha);
			
			_fade.Modulate = color;
			if(timer < 0){ timer = 0; }
		}
	}
}
